/*
背景

渣本毕业，学历一般

中文系出身，非科班大四转行，总体基础不行

一年工作年限，`项目毫无亮点，满足不了社招条件

裸辞待业在家，无经济收入来源


优势
劣势太大了，所以优势不值得一提，所以一年经验或者 2 年经验的同学还是慎重裸辞


极光推送
一家以大数据业务的公司，规模来说挺不错的


一面
1、如何获取数组中最大的数

2、数组和链表的使用场景

3、了解哪些排序算法，说说冒泡排序和快排的区别

4、算法：背包问题

5、浏览器缓存


二面
1、输入一串 url 到浏览器，会发生什么？

2、vm.$set 原理

3、深拷贝如何解决循环引用

4、http 缓存头部字段

5、vue 和 react 的区别

6、讲讲前端路由

7、一道查找路径的场景题

8、一道如何优雅处理异步的场景题

9、webpack 工作流

10、webpack 是如何解决两次引入的


三面
1、公司团队规模

2、讲讲 http 三次握手，为什么需要三次握手

3、讲讲 http 四次挥手，为什么需要四次而不是三次

4、如何看待 toc tob 端业务

5、对于新技术如何看待

6、小程序有了解过吗


四面HR
1、在小组担任的位置

2、说说你工作中遇到有挑战的项目

3、期待薪资


五面VP
1、非科班的你如何学习的

2、看过那些书，讲讲收获

3、详细讲讲 DNS 如何进行解析

4、数据库范式

5、了解 golang 吗（简历没写数据库和 golang 的字眼）

总结
到第三面后，等了一个星期并没有通知，所以极光的面试体验挺差的，后面 HR 突然加我谈薪资，极光四面 HR 面我要了 17K，HR 说一年 17 挺难的，然后帮你约 vp 面，最终面的时候，我记得那时候是下雨天，面试的环境零时准备答的并不是很好，而且问的都是后端相关的，有毒
*/