/*
一面
编程猫的一面面试官是拿着题库问的，问的很多，好像问了一个半小时
1、布局的几种方式

2、rem vw 的区别

3、rem em 的区别

4、讲讲 React 生命周期

5、webpack 你是如何做优化的

6、浏览器缓存

7、react 性能优化

8、vue 如何做权限检验

9、讲讲 http2.0

10、你是如何做性能优化的

11、单元测试如何测试，代码覆盖率如何

12、react 生命周期

13、说说 react 状态逻辑复用问题

14、react fiber 节点（不会，没研究过）

15、Koa 中间件原理

16、Redux 工作流？

17、Koa 如何实现监控处理

18、如何实现 Redux 异步功能

19、Redux 如何优化

20、commonjs 的实现原理

21、讲讲垃圾回收机制

22、Vue 和 React 的区别

23、函数式编程 如何理解纯函数

24、Node 原生 api 错误处理有了解吗

25、说说浏览器渲染流程

26、说说重绘和重排

27、说说那些属性可以直接避免重绘和重排

28、treeshaking 原理

29、按需加载的原理

30、讲讲原型链

31、了解过那些前端构建工具 分别介绍他 webpack rollup gulp

32、双向数据绑定原理

33、说 vue 如何收集依赖的

确实问了很多，而且自我介绍中我说熟悉 vue，面试官问：“你熟悉vue，那么来说说React生命周期有哪些”，?汗颜，我大概回答的正确率 ✅ 有 90%左右


二面
架构师
1、组件库设计有什么原则？

2、组件库是自己从 0 开始搭的吗，说说有哪些特点

3、如何实现组件库按需加载

4、讲讲 http2.0

5、讲讲 react fiber 节点


三面
三面是技术负责人，不过从问题来看是不懂技术的
1、说说你的优点与缺点

2、公司加班情况

3、期待薪资
*/
