/*
群里的一位老哥找到了我，可能以为我三年起步了，内推我去 360 金融试试，后来沟通中知道我是一年的，当时还是推了我的简历过去试试了，当时心里想的是，过去试试吧，当炮灰也行哈哈哈 ?
从 2 点一直面到 6 点，脑袋都懵逼了，每道题都问的挺深入的，给面试官的专业点赞,面试体验也不错，后面就拿到了 360 金融的 offer了，自己有点不敢相信，毕竟当时面的岗位门槛是3-5年的，也是有足够的运气


一面
1、内联元素与块级元素

2、数组 api 介绍

3、dom 操作有哪些 api

4、数组去重有哪几种方式

5、变量提升问题

6、柯里化问题

7、数字转金额的问题

8、手写防抖和节流

9、判断变量的几种方式，有哪些不同

10、动态规划算法题


二面
1、什么是暂时性死区？

2、块级作用域和函数作用域

3、call bind new 实现原理

4、vue 双向绑定原理

5、LRU 算法

6、http2.0 的有哪些内容

7、http 缓存

8、rem vw 区别

9、移动 1px 问题

10、函数柯里化

11、diff 算法

12、虚拟 dom

13、nextTick 原理

14、事件循环

15、闭包

16、如何解决移动端 click300ms 延迟？

17、vue 有哪些全局组件

18、移动端如何完成拖拽功能？

19、防抖和节流的区别

20、一道逻辑题：有 5L 的桶和 3L 的桶，如何拿到 4L 的水


三面
1、防抖和节流的使用场景，举例说明

2、居中的几种方案

3、事件循环

4、移动 1px

5、setTimeout 与 rAF

6、flex:1什么意思

7、介绍下你写的库

8、发布订阅和观察者的区别

9、单例模式

10、发布订阅和观察者的区别

11、JSONP 实现原理

12、移动端点击延迟怎么处理

13、git flow 工作流介绍

14、两道场景题-问的很深，很久

15、怎么做性能优化

16、性能监控如何做

17、跨域解决方案

18、简单请求和复杂请求

19、多路复用


四面
1、经过前面三轮，感觉如何？

2、git flow 工作流介绍

3、团队规模

4、如何进行 code review

5、平时怎么学习

... 四面问的不多，都是聊技术外的话题


五面
1、职位规划？

2、有什么要问的吗

3、什么时候可以入职

4、有其它的 offer 吗？
*/
