/*
涂鸦智能的 HR 安排的岗位是门槛是三年起步的高级开发岗位，? 当时也没有底，就去试试了，然后顺便面基了在涂鸦工作的同事


一面 
自我介绍还是介绍自己熟悉 vue，但是还是 ? 问了下 react 问题，所以 掌握 react 确实是必须的

1、讲讲 react 生命周期

2、讲讲 ts 中 type 和 interface 的区别

3、说说 http

4、说说 vue 双向绑定

5、diff 算法

6、虚拟 dom

7、http 缓存

8、讲讲 http2.0

9、说说状态逻辑复用问题

10、介绍下项目的亮点

11、介绍下 es6 新增了哪些特性

12、Reflect 的用途？

13、域名切片

14、为什么 vue 或者 react 要求 key 值唯一


二面 
二面是杭州那边的面试官视频面的，问了 15 分钟左右，是最快的一次面试

1、平时怎么学习的

2、MVVM 实现

3、data 里面为什么是函数

4、UDP TCP 区别

5、vuex 应用场景

6、说说 XSS 攻击

7、说说 vue 的模板编译

8、说说你项目的亮点

9、new 原理实现

10、状态码 403 404 503 304 说说

11、diff 算法

12、虚拟 dom

13、说说事件循环

14、react16 的重大更新

15、为什么废除三个 react 生命周期的 api

16、讲讲 fiber

17、浏览器缓存

18、nextTick 原理

19、说说你的 vuex 持久化插件

三面 
1、住在哪里，哪里人，到公司多久？

2、有了解涂鸦智能吗？

3、期待薪资

4、平时如何学习

5、什么时候可以入职？

总结

涂鸦的面试很快，自己也认识很多在涂鸦工作的朋友，也跟他们聊了挺久，顺便蹭了杯奶茶哈哈哈，也拿到了 offer
*/
