/*
一二面会有手写代码测试，一面或者二面当中，有一面必须到现场来的，对工作环境有一个直观的感受，前端二面取消了
一面（通过）

1、自我介绍、项目经历

2、怎么跟 xx模板的开发同学去沟通的呢？此处省略 N 个项目相关的问题！！

3、然后你介绍一下项目的难点，你是怎么解决的？ 你有什么思考

4、React 设计思路、或者说运行的流程？ React 它是一个怎么样的设计？分哪些部分，怎么去走的？

5、组件是数据驱动的这样一个方式，封装state，最终的话更新到dom节点，那么在这个过程当中，其实有很多的步骤，你可以介绍一下 我们常常关注的一些节点吗？

6、那它是怎么更新的呢？ 中间的过程是怎么样的呢？你刚刚讲得比较粗糙

7、setState的更新流程

8、那它在什么时候会更新虚拟DOM树呢？ render 的时候可以深入讲一下

9、批量更新的状态：它是怎么设置的？

10、react的状态管理：怎么理解redux的设计方式呢？ 分为几个层次去说呢？

11、定义 多个 reducers ， reducers是一个什么概念？那 dispatch 怎么能知道我通知的哪个 reducers 呢？

12、有了解 过 React Fiber 最新的架构吗？那它的中断由谁去中断的？

13、有接触过网络接口的封装吗？

14、网络请求的源码？ 比如有看过 axios 源码，封装过吗？比如说一个网络请求：有请求头，header 有哪些？

15、像文件的下载和上传的话：下载文件会牵扯到断点续传，有可能是怎么做到的呢？

16、那上传文件呢？ 上传怎么实现？

17、formdata 的格式？

比如说文件，它其实最终的话传输肯定是一种二进制文件吗？那么二进制文件的话，到了流里面的话，其实后端它也不知道是什么东西？那么肯定会有一些额外的东西，需要告诉后端，我这边，比如说长度是多少，类型是什么. 等等乱七八糟的东西？ 你这一块知道吗？

18、组件的设计规范：比如说你设计一个button，怎么样能够设计出一个好的 button？

比如说这边有这种情况：颜色，边框，边框粗细？文字的大小，基础的能力都有了，那业务方希望说我希望边框是曲线的边框，这时候你应该怎么办？ 你怎么去考虑

19、CDN 和 DNS 有了解过吗？

CDN 是一种资源的同步更新，像主节点更新了，其他边缘节点 是一种什么样的策略，来保证跟它的主节点保持一致呢？ 比如说我主节点更新了，其他节点其实还是老的，怎么去更新呢？更新有怎么样的策略呢？或者说怎么去处理呢？

嗯，文件名称和时间戳？那它怎么跟主节点去对比呢？我就知道它的时间戳是这一个，然后我怎么知道它去更新的，它跟谁去对比呢？

20、算法题： 无重复的最长子符串长度（写出来了）

21、反问

React技术栈
toC 社交产品部业务
平时工作节奏： 10点上班，晚上6点 、7点走人
*/
