/*
UMU：
AI 驱动的效果学习平台
UMU 利用学习科学和 AI 技术，让学习真正指向绩效提升，同时提升企业培训的效果、效率、体验。UMU 广泛应用于销售、经销商、新员工赋能，助力企业实现人效提升、绩效改变、收入增长。


前两面都是远程, 终面去了公司现场。到了之后先做了一份测试题, 大概就是考察基本认知能力的。完事后CTO来面试, 直接在现场小黑板上写题。大佬对各种技术都能侃侃而谈, 确实很厉害, 不过听说周六可能要加班, 而且担心稳定性, 就没选择这里。


一面
除了项目, 基本都是问的日常开发相关的东西, 比较实在

1、node.js如何调试

2、charles map local/map remote

3、chrome devtool 如何查看内存情况


二面
1、koa洋葱模型

2、中间件的异常处理是怎么做的？

3、在没有async await 的时候, koa是怎么实现的洋葱模型?

4、body-parser 中间件了解过吗

5、如果浏览器端用post接口上传图片和一些其他字段, header里会有什么? koa里如果不用body-parser，应该怎么解析?

6、webscoket的连接原理

7、https是如何保证安全的? 是如何保证不被中间人攻击的?


终面
1、【代码题】 给一个字符串, 找到第一个不重复的字符

ababcbdsa
abcdefg
2、时间复杂度是多少?

3、除了给的两个用例, 还能想到什么用例来测试一下?
*/
