/*
面试过程中的问题
1、简单自我介绍一下

2、我看你们做的这些事情，对前端来说是挺有意义的吧，提效工具这一块，减少开发。组件库、脚手架这种、模板 可以对前端提效是吧

3、我想问一下您想换工作的原因： 工作环境和涨薪

4、那我了解的话，主要还是薪资方面的问题，两年没涨。你们公司的涨薪制度是怎么样的？是环境不好吗？

5、您在你们团队担任的是一个什么角色？

6、目前在职看机会，您对新的工作主要是薪资方面是吧？期望多少？您老家哪里的？杭州比北京近一点

7、那你能讲一下你的项目吗？你脚手架那块的话，我理解是说，可以通过指令生成一些项目的模板，是这样子的吗？

8、cli 下载应该是拉了一个仓库的模板？比如说，我们用户需要引入一些资源，这个是用户自己选择，这个有做吗？大概的意思是问：项目初始化的时候，有没有很多资源，可以让用户自己选？？？比如说刚才你说的作者、一些基础信息可能是刚开始拉的时候可能就要填了：

那有没有不是基础信息的：比如一些js的引用，包的引用，可能是需用用户自己去配的，这一块是需用用户自己去配的，你是说通过一个配置文件去配，是把？

此处省略多个项目相关的问题。。。


面试官说，接下来问一些技术方面相关的问题：

9、这两年主要做PC项目，移动端没有涉及

10、那你们这个ui 框架会对屏幕的大小做适配吗？

11、不同屏幕的大小适配是怎么做的？不同的屏幕不是自动变宽吗、变高吗？

12、rem font-size 是怎么算出来的？ 根据屏幕的宽度 根据 可视窗口的宽度 动态修改 大小

13、PC页面的重绘和回流的区别

14、比如说有一个父元素它的透明度是 opacity：0.5，子元素我给它设置为 1； 这个子元素的透明度是多少？

15、那如何设置子元素的透明度为1呢？

16、用 const 定义了一个 对象后，能用另一个对象替换吗？

17、JS内存泄漏有哪些情况？

18、闭包为什么会造成内存泄漏

19、我们有一个业务，它的执行时间是超过 5秒的，它要10秒才能跑完，我这时候又想着每五秒 又想着 去执行这段代码，这个业务场景 应该怎么实现？

20、比如一个大数据的循环，可能需要10 秒执行完，但是我又要 每个 5秒去 执行 一下这个程序？

21、有一题比较简单的算法题，打开编辑器。 求两个数组的交集

22、你们会对前端的数据做加密处理吗？加密它是一种怎么加密的方式？

23、最近有用过 chat gpt 吗？ 没有装 copilot 能大概说一下 chat gpt吗？ 简单的定义

24、技术栈主要是 react、哪个vue有接触过吗？问几个简单点的问题：watch 和 created 谁先执行？在 Vue 里面挂载全局方法？Vue 强制刷新组件：子组件的强制刷新方法。当需要对当前组件进行强制刷新操作，可以调用this.$forceUpdate() 强制刷新当前组件。

25、能解释一下 React 虚拟DOM的工作原理？React 虚拟DOM 对性能方面有什么帮助？React 的错误边界有了解吗？

26、什么业务场景下，会用到错误边界，它用在哪个地方会比较好？

27、哪个TS有用过吗？

28、反问：9点-21点工作 大小周，小周不打卡、技术分享

哪个业务线：B2C集群下面，C端业务、H5为主
主要 Vue + TS，其他部门用React
计划招收 x 个社招名额
*/
