/*
本人4年前端，CVTE（二面挂了），还是有点难


一面
时长：46分钟，自我感觉一般。
1、说一下JS事件循环？JS是多线程的吗？（ps:我前面描述回答有点瑕疵）知道哪些微任务和宏任务？微任务和宏任务的区别？绑定一个事件的回调函数是宏任务还是微任务？

2、说一下JS闭包？怎么创建闭包？有什么缺陷？怎么解决？

3、刚刚你有说到垃圾回收，说一下垃圾回收吧。

4、如果想知道一个页面有没有存在内存泄漏的情况，怎么做？

5、刚刚你有说到性能优化，在这过程中你是怎么利用chrome开发者工具的？

6、WebWorker的缺点是什么？在worker线程怎么获取主线程上下文？解决卡顿的问题除了使用WebWorker还有其他的解决方案吗？面试官建议我去了解一下React的fiber。有没有测试过woker通信的时间？

7、项目遇到的技术难题？

8、虚拟列表是什么？

9、Vue双向绑定的原理

10、Vue基本原理你会什么？说一下diff算法，看我能不能听得懂？（面试官是用React的）

11、webpack做过哪些构建优化？

12、封装公共组件，需要注意什么？


二面
时长：42分钟，一半的问题都是回答不知道。
1、项目相关，问了好久。。。

2、共同编辑文档有了解吗？

3、说一下面向对象吧，多态是什么？

4、说一下vscode插件是怎么做的？

5、设计模式有了解吗？除了观察者模式还有其他的吗，平时用得上的。

6、说一下微信小程序吧

7、移动端适配有了解吗？rem布局

8、WebAssembly有了解吗？

9、Electron有了解吗？

10、TypeScript有了解吗？

11、最近有在学什么新的知识点，除了我们上面说的。
*/
