/*
一面（通过）
1、好，那我们开始把，先简单介绍一下自己的一个经历，以及自己有亮点的项目？balabala

2、你可以这样介绍：在这里边主要负责哪几个项目，哪些项目是比较有亮点的，亮点的地方在什么地方？或者是你觉得在这里面你觉得是 比较有挑战的地方？然后简单的介绍一下是怎么解决的？

3、你们低代码服务的业务是什么？这里边现有的组件有哪些？ 有多少个组件啊，都是什么分类组件啊

4、你们这个低代码的用户有哪些？这些用户是企业对应的运营直接在平台上操作吗？这个低代码都包含哪些能力？此处省略 N 个项目相关的问题！！！

5、自定义组件它的渲染的流程是什么？我不太想问这个过程，我不太想了解你们怎么定义它的，我想了解的是你对这个方案的一个理解？你可能需要描述得细节一点：我对你的这个描述，听不出任何细节的东西

6、ok，看两道题目

图片

7、字符串全排列：输入一个字符串，打印出该字符串中字符的所有排列。结果放在字符串数组中返回，但里面不能有重复元素。
输入：s = "abc"
输出：["abc","acb","bac","bca","cab","cba"]

8、esm 和 cjs 的区别？

9、requestAnimationFrame和requestIdleCallback 的执行时机，谁先执行？ requestIdleCallback 是绘制前执行还是绘制后执行？

10、React Fiber 遍历DOM结构的顺序是？

11、说两个场景啊：自适应布局的：有一个父容器，3个子组件，和父组件等高的，3个子组件均分父组件的宽度

12、那如果非均分呢？每一个字符串填充字符串，取决于字符串的多少？

13、说一下 em、rem、vw、vh、rpx 的含义

14、useMemo 和 useCallback 的区别

15、手写实现 new 方法

16、你最近还有其他的面试吗？都在面哪些公司呀？

17、你感觉低代码这个方向：怎么看啊？？？

18、你现在做的这个低代码，对于你来说这个，最大的痛点是啥？现有的方案，对于最大的痛点

19、你这个低代码平台的组件是动态加载的吗？整体打包的？

20、反问：
主要技术栈：vue，业务线：社区的一些基础产品
平时工作上班节奏：早十晚九 大小周
部门预计招收多少人？


二面（挂）
总体来说项目答得不好，h5 拖拽顺序没答上来，算法题做出来了

1、简单自我介绍

2、你们这个团队主要做的业务是什么？你们团队为什么想到要做这个低代码？

3、你们做的是一块怎么样的业务呢？能大概介绍一下吗？都有哪些业务场景？

4、你在这个低代码项目当中主要负责的是什么？能大概介绍一下 xx 模块 吗？此处省略 N 个项目相关的问题！！！

5、诶，能大概讲一下这里面的技术设计吗？就是听起来它还是一个产品流程的描述，能大概讲一下代码是怎么去设计的吗？

6、比如说，你们是怎么把它渲染成组件？用的H5的原生拖拽？能大概介绍一下H5原生拖拽它的这一个 拖拽的顺序吗？ 然后这个过程中会触发哪些事件？能按照拖拽的执行顺序说一下嘛？

7、drag 拿到的一个对象是一个怎么类型的对象？

8、为什么会使用原生 H5，不直接使用一些市面上开源的一些工具库、方案？

9、使用原生 H5 有哪些好处？相比于 开源的一些工具库，或者说它 有哪些实现不了的？

10、这个拖拽能力 你有做过一些什么样的封装吗？

11、就你不可能直接使用原生DOM进行操作把？总归是有一些封装的吧？代码是怎么组成的？拖拽这个能力作为一个比较独立的功能，你们没有任何封装？此处省略 N 个项目相关的问题！！！

12、你们怎么去评价这个低代码项目做得好与不好啊？你们会怎么样去评估这一件事情（低代码）？

13、你们现阶段在一个什么样的水平？它大概能缩短多少周期？

14、你们这个低代码页面支持搭建多少个页面？都有在线上去运行吗？

15、这个自定义 webpack 插件，是为了解决什么样的问题？

16、算法题：数组乘积的操作，除了自己以外，所有其他数组的乘积（写出来了）

17、现在考虑机会的原因是什么？

18、有什么问题想问我的？

小红书 Vue，工作节奏：大小周，早10晚9
你们主要的base哪些：上海、武汉
前后端大概多少人：60 70人吧，还不算独立方的，发布团队
*/
