/*
主要是拼多多中后台这一块，技术架构，develops，监控，埋点，node sdk，还有拼多多内部的小二 一些系统（电商平台的客服系统？），主要是中后台这一块


一面
1、同学你好，简单的自我介绍？介绍项目？主要做哪一块？你们几个人在做这个？

2、问技术栈：主要是React，先聊一下React，再聊你项目里面的东西

3、react的路由有几种模式：hash（hashchange） 和 history （replaceState、pushState）？项目主要用哪个路由模式？

4、用的 hooks 多一点 还是 class 多一点？自定义的hooks多吗？平时常用 hooks

5、比如说封装过哪些 hooks ？ ok，你可以写几个平时封装过的hooks吗？

6、useCallback 和 useMemo 用过吗？ 区别是？

7、useContext 哪个场景会用到它

8、redux全局的store， store是怎么跟react组件关联在一起的

9、项目的TS使用得多吗？

10、组件库会有一个像 modal 的这个组件，有没有想过如何实现一个通用的这个组件？功能比较简单一点，比如说有一个全局的蒙层，上面有一个居中的弹框，有一个关闭按钮，可以把弹窗和蒙层关闭掉，如果我想用react自己实现一个，应该怎么实现？

11、自己有对 webpack 了解吗？ webpack的整体流程

12、常用的loader 和 plugin 有哪些呢？

13、自定义一些插件，自己 有写过哪些插件呢？自定义的插件的流程？我看你写过自定义插件，它的作用是，解决了什么问题？

中间穿插几个项目问题，省略了。。。

14、ok，聊一下ES6的promise吧，它的静态方法的区别：all、race、allsettled、any

15、手写 promise.allsettled 的实现

继续问项目：

1、你现在负责的项目，主要负责那一块的开发

2、画布区里的组件是 自由布局吗？

3、搭建的面板你有参与开发吗？

4、你们现在成品用户多吗？主要是卖给谁呢？谁在用？你们现在这个平台，现在能盈利？也就是说你不知道你做的这个东西有多少用户在用？你感觉你们现在这个平台，这个技术的复杂点、最主要的复杂点是在哪里？你们的客户也是有研发团队的是吧？

5、你现在是在职状态还是离职？在职看机会的原因是？现在手上有拿到哪些公司的offer吗？现在在面试中都有哪些公司？

6、你有什么问题想问我吗？

主要做哪些业务：主要是拼多多中后台这一块，技术架构，develops，监控，埋点，node sdk，还有拼多多内部的小二 一些系统，主要是中后台这一块

7、主要技术栈是什么？React

我们平时的工作节奏，hr 跟你讲了吗？ 11 -11 10-10 9-9

啊？我们不是大小周，每周周日过来

你现在的节奏是怎么样，感觉差不了太多，这个节奏能适应吗？


二面（挂）
1、你毕业之后一直在 xx 公司吗？两年，在哪个城市？换工作的原因？你老家是哪里的？简单的介绍一下项目？

2、讲一下低代码这个系统是怎么设计、怎么实现的？在实现上有哪些难度啊？balabala，此处省略几个项目相关的问题

3、这个事情（项目），你们做了多久？

4、你现在找工作有什么样的期望？你从北京到上海工作应该没有问题吧？你是南方人吧

5、实现图片的懒加载

6、还有一道题目做一下：Promise.race相关的，它的实现，超时后重试，多个场景综合考察题

想了很久，重试没写出来

7、反问

主要技术栈，react
主要负责业务：主要负责公司内网所有的前端系统
平时工作节奏：差不多一天干12个小时吧
*/
