/*
timeline：

5.17一面
5.21 笔试
5.22 二面
5.24 总监+hr面
5.28 意向


一面
电话面（1h疯狂拷问）
1、自我介绍

2、vite的打包原理？和webpack区别？

3、vite热更新原理？

4、是用的http协议还是websocket协议？

5、http和websocket区别？

6、除了应用层还有哪些层？分别都有什么协议？

7、SSL/TLS协议是什么？

8、https是怎么工作的？

9、vue的底层原理？ 比如说怎么从template变成render

10、vue2和vue3响应式区别？

11、vue2defineProperty怎么对数组进行处理的？

12、data()为什么是函数而不是对象？

13、vue的路由模式？分别是监听什么来获取的

14、diff算法和时间复杂度？

15、vue3diff算法的改进？

16、promise和async/await的区别？

17、async和await的原理？

18、promise的链式调用怎么实现的？

19、promise.all之类是在类上面的吗？

20、有没有什么在promise实例上的方法？

21、说说浏览器缓存？

22、缓存的一些状态码？

23、etag和last-modify优先级 为什么？

24、last-modify缺点？

25、数组和链表区别 优缺点？

26、知道哪些排序算法？

27、说说归并排序 稳定性和时间复杂度？


二面（30min）
1、自我介绍

（疯狂拷问数据结构...？？）

2、有哪些常见的数据结构？数据结构分类？物理结构和逻辑结构

3、链表的增删改查时间复杂度 应用场景？

4、树有哪些常见的 应用场景有哪些？

5、堆的应用场景？

6、图的算法有哪些？

7、动态规划是怎么实现的？

8、计算机网络通信的过程（传输层）？

9、计算机网络硬件有哪些？


三面总监面（30min）
1、自我介绍

2、项目有部署上线吗？

3、介绍一些项目里主要负责什么部分？

4、主要介绍其中一个部分？

5、这部分中有没有遇到什么困难 怎么解决的？

6、css的postion有哪些？

7、relative主要是相对于什么？

8、盒子模型？

9、css的常见单位？

10、js原型链？

11、基本数据类型？

12、forEach怎么退出？

13、http和https区别？

14、ca证书有哪些类别有了解过吗？

15、有抓包过吗 抓过哪些 用什么抓的？

16、除了js还会哪些语言？

17、node之类的有写过吗？
*/
