/*
1、做的主要是什么项目，桌面端的吗？

2、用的主要是什么技术栈？vue有了解吗？

3、移动端开发一般怎么判断是什么平台，安卓、IOS、微信？

4、移动端页面，页面的尺寸、宽高怎么去处理？

5、怎么根据设计稿的尺寸计算出rem

react相关的问题

6、函数式组件，在一个应用周期里，什么时机会被调用到呢，函数会被调用多少次

7、什么情况下会触发组件更新？

8、子组件没有任何的props,父组件在渲染的时候，子组件会跟着渲染吗

9、React.memo会做什么处理

10、组件return JSX,这个需要在编译的时候转化才能运行，在编译阶段会被转义成什么JS代码？

11、react函数式组件，hooks有一定的写法规范，是出于什么样的考虑，会有这样的限制？

12、react fiber是在什么情况下诞生的，是为了解决什么问题

13、react优化需要手动优化、有没有一些方案可以自动处理这个问题

服务端渲染相关问题

14、项目中有没有服务端渲染的项目，有没有了解过如果用react需要配合什么框架去做

15、对服务端渲染原理了解吗，比如是怎么实现服务端渲染的？

16、服务端要做什么处理，达成生成DOM结构的目的？

vue相关问题

17、怎么实现响应式，依赖收集

18、react vue性能方面的差异

19、vue有computed, react是怎么处理的

20、对除JS之外的其他语言有了解吗

21、编程里进程和线程的概念

22、一个进程可能会有几个堆几个栈

23、堆内存和栈内存为什么会分成这两种，各自有什么不同

24、JS是一个单线程的语言，它这个特点有什么好处吗，为什么要设计成单线程的？

25、nodejs相较于其他的服务端，有什么优点吗？

26、 js运行需要什么

27、V8是用什么语言写的，为什么要用

28、高级语言需要什么样的步骤才能让计算机运行

29、编译C++代码的程序是用什么语言写的

30、用nodejs写过什么吗

事件循环能解释一下吗

31、如果有一个setT而eout(()=>{},1000),这个回调是什么时候进入到队列里排队呢，是执行到setTimeout的时候，还是等1000ms

之后呢

32、事件循环，这些是谁在处理

33、浏览器环境下，JS执行在哪个进程哪个线程

34、解释一下闭包

35、有没有什么必要条件需要满足才能产生闭包

36、如果有一个外部函数内部返回一个内部函数，内部函数引用了外部函数的变量，产生闭包，如果这个外部函数被调用10次，会产生多少个闭包呢？

37、对其中一个闭包里的变量进行修改之后，会影响其他闭包里的变量吗

38、有没有别的写法能生成闭包

39、原型链继承方式

40、递归的定义，用到的场景有哪些

41、解释一下谜表？

42、深拷贝

43、遍历对象的所有属性

44、for...in...

45、Object.keysf)

46、CSS定位有哪几种
*/
