/*
前端｜期望 32K｜字节 3 轮

一面
1、【代码题】 二叉树层序遍历, 每层的节点放到一个数组里

给定一个二叉树，返回该二叉树层序遍历的结果，（从左到右，一层一层地遍历）
例如：
给定的二叉树是{3,9,20,#,#,15,7},
该二叉树层序遍历的结果是[[3],[9,20],[15,7]
]

2、【代码题】 实现一个函数, fetchWithRetry 会自动重试3次，任意一次成功直接返回

3、【代码题】 链表中环的入口节点

对于一个给定的链表，返回环的入口节点，如果没有环，返回null


二面
1、截图怎么实现

2、qps达到峰值了，怎么去优化

3、谷歌图片, 如果要实现一个类似的系统或者页面, 你会怎么做?

4、最小的k个数

5、节流防抖

6、sleep函数

7、js超过Number最大值的数怎么处理?

8、64个运动员, 8个跑道, 如果要选出前四名, 至少跑几次?

9、前端路由 a -> b -> c这样前进, 也可以返回 c -> b -> a, 用什么数据结构来存比较高效

10、node 服务治理

11、【代码题】 多叉树指定层节点的个数


三面
1、【代码题】 叠词的数量

Input: 'abcdaaabbccccdddefgaaa'
Output: 4

1. 输出叠词的数量
2. 输出去重叠词的数量
3. 用正则实现
*/
