/*
背景
毕业之后投递360，入职了360企业安全成为专门的前端开发工程师，有幸进入一个很赞的团队，遇到很棒的导师和leader，成长杠杠的。

四面后逛拉勾时有猿辅导要简历给了过去，然后去现场面试了一波，也是白纸写代码，三轮技术一轮HR，比较稳妥的过了（有一道题很简单但脑子当时不灵光，卡了好久，面试官引导多次无果后换了个题，很快做出来了，这里给猿辅导面试官们点赞，体验都很棒），过了之后HR问我还面谁没，我明确说了在面腾讯还差一轮现场，于是HR说等我面完腾讯再讨论具体待遇，但offer肯定能给。

几天过后，HR电话告诉了我薪酬，也给我介绍了腾讯的一些福利和团队文化，然后说offer流程已经发起，让我等邮件，漫长的一周过后，offer终于来了，感动！！！


一面（现在的导师）
1、性能优化

2、http缓存

3、做过的有特点的项目

4、遇到的问题与解决方案

5、toB和toC的区别

6、现场面对客户的经历

7、前端安全相关(着重中间人劫持)

8、为什么跳槽

9、职业规划

10、有什么问我的(团队简介、前端参与项目的过程)


二面（资深前端研发同事）
1、项目开发流程

2、对vuex的看法

3、vue从data改变到页面渲染的过程

4、介绍状态机

5、组件设计原则

6、怎么看待组件层级嵌套很多层

7、前端安全防范措施

8、介绍oauth

9、怎么看待virtual dom

10、对flutter的了解

11、weex和rn原理

12、大屏用的技术

13、大屏数据来源与管理

14、websocket的使用场景

15、pwa的使用

16、对http2的了解

17、对新技术的了解

18、职业规划

19、为什么想来腾讯

20、有什么问我的（团队协作方式、技术积累、对我的期待）


三面（小团队负责人）
1、为啥想离职，现公司不好吗

2、360企业安全和360啥关系

3、你认为蓝信为什么要有支付功能

4、剩下全聊简历上的项目，就不描述了

5、有什么问我的（招人原因 node使用场景、技术栈、项目集成方案）


四面（工作室组长）
1、介绍项目特色与难点

2、性能优化

3、对MVC MVP MVVM的了解

4、对SEO的了解

5、做了道逻辑题

6、国内前端行业的发展

7、有什么问我的（团队名称的意义、团队的业务、如何定位前端在设计团队的角色）


五面（部门经理）
1、同事怎么看待你

2、你的优点

3、你的缺点

4、你还能提高的地方

5、三年内的职业规划

6、其他的日常聊天

7、有什么问我的

部门在 XXG 以至公司的定位（相比于公司其他方向的部门，我们的特点是？  相比于同方向其他公司的部门，我们的特点是？）

设计师、产品、研发之间的合作

部门对公司或对行业最大的贡献是？

五面如上所说，还和其他大佬们聊了聊天，主要有前端能力范围、团队成员技术能力培养、部门技术开源、部门优秀项目等。整体难度还行，可能是电话不方便所以没出算法题，面试问题范围挺全面的，几乎都能和面试官扯一扯（flutter、RN、Weex啥的虽然没用哟，但没吃过猪肉也看过猪跑，主要是现在吃不起猪肉了哈哈），面试体验不错，电话面的时间都是工作日下午四五点或者周末，现场面请了天假过去，路费全报销（住宿费也报，但我早上去晚上回，没住）。
*/
