/*
基础知识类
1、介绍 promise？能不能手写出 promise？promise 相关的题目：值的传递、错误捕获等综合题目？

2、react的路由有几种模式：hash（hashchange） 和 history （replaceState、pushState）？项目主要用哪个路由模式？

3、JS内存泄漏有哪些情况？闭包为什么会造成内存泄漏？

4、函数式编程理解？

5、http和https区别？https建立的过程？

6、微前端了解过哪些框架？如何选型？

7、qiankun的js沙箱和css沙箱原理是啥？

8、在 v-for 时写了 key ，将第二个元素和第三个元素交换了顺序，实际的 diff 算法怎样的‍‍‍‍

9、聊一聊浏览器的渲染机制，浏览器是怎么解析和渲染html的？

10、重定向的状态码有哪些？它们的区别是什么

11、说下 vue-router 的实现原理

12、uni-app是如何打包成各个平台能运行的代码的？

13、vue3中做了哪些优化？

14、vite、webpack、rollup的区别是什么？

15、手写Promise.all

16、浏览器内存你在实战中处理过吗？

17、、浏览器的垃圾回收机制是什么样的？

18、、你在做微前端的时候，为什么选择qiankun

19、qiankun的原理了解哪些

20、你在使用qiankun的时候，有没有发现这个框架的不足之处

21、使用ts的时候，有没有什么心得

22、ts注解用过没有？是什么？

23、跨域问题解决方法

24、cookie，localStorage,sessionStorage区别

25、说一说前端性能优化的方案

26、Vue 代码或者 React 代码到页面渲染的过程发生了什么

27、ES6数组的解构赋值和对象的解构赋值有什么区别？

28、ES6里的Class和ES5里的继承有什么关系？

29、ES5有哪些继承，以及ES6里用的是哪一个？

30、什么是闭包？闭包的应用？为什么父函数被销毁了子函数还能取到值？

31、Vue里的data为什么是一个函数？

32、computed和watch的区别？computed为什么可以缓存？

33、发布订阅模式和观察者模式的区别？


算法类
1、冒泡排序，快排，快排稳定吗，时间复杂度多少，如果是123456快排复杂度多少？

2、用react实现一个倒计时的hook,写完讲思路

3、实现最大并发3个图片的线程池,写完讲思路

4、array转tree,写完讲思路

5、手写深拷贝

6、手写实现一个倒计时组件


综合类
1、你可以这样介绍：在这里边主要负责哪几个项目，哪些项目是比较有亮点的，亮点的地方在什么地方？或者是你觉得在这里面你觉得是 比较有挑战的地方？然后简单的介绍一下是怎么解决的？

2、你们现在成品用户多吗？主要是卖给谁呢？谁在用？你们现在这个平台，现在能盈利？也就是说你不知道你做的这个东西有多少用户在用？你感觉你们现在这个平台，这个技术的复杂点、最主要的复杂点是在哪里？你们的客户也是有研发团队的是吧？

3、你现在是在职状态还是离职？在职看机会的原因是？现在手上有拿到哪些公司的offer吗？现在在面试中都有哪些公司？


场景类
1、说两个场景啊：自适应布局的：有一个父容器，3个子组件，和父组件等高的，3个子组件均分父组件的宽度

2、我们有一个业务，它的执行时间是超过 5秒的，它要10秒才能跑完，我这时候又想着每五秒 又想着 去执行这段代码，这个业务场景 应该怎么实现？比如一个大数据的循环，可能需要10 秒执行完，但是我又要 每个 5秒去 执行 一下这个程序？

3、实现一个css框架你有什么思路吗

4、一个很大的json文件，前端读取如何优化

5、前端监控如何设计

6、假如 UI 给你一个朝向 ↖️ 的静态资源图片，如何通过 CSS 让这个图片朝向 ↗️，（这个不会，面试官说有一个 CSS 属性 scale 变成 -1 就可以做到，回去 google 了一下，transform 到 3d 也可以）
*/
