/*
一面
1、防抖和节流
2、用递归实现阶乘比如传入5,就返回5*4*3*2*1的结果
3、箭头函数和昔通函数的区别
4, https和http的区别
5、前端缓存
6、E56新增哪些特性
7、 vuex
8、原型和原型链
9、异步任务分为哪些
10、前端性能优化问题
11、垂直居中的方式
12、怎么理解回流和重绘
13、元素显示和隐藏的方法有哪些
14、做的比较好的项目，展开讲讲
15、深拷贝和浅拷贝，怎么实现T深拷贝说思路
16,内存泄露是什么，怎么导致的
17、promise介绍
18, vue和react的区别
19、数组去重的方法？至少说出2种

二面
1、深拷贝和浅拷贝，如何实现一个深拷贝
2、如何实现一个new
3、怎么理解回流和重绘
4、前端如何做性能优化
5、平常是如何学习前端的？
6、微前端了解吗？（没回答上，表示自己后面会学习）
7、nginx有了解吗，如何用nginx做重定向
8、跨域是什么？怎么解决？ jsonp方式是如何做的
9、事件循环说说，宏任务和微任务有哪些
10、this指向问题
11、了解axios的原理吗？怎么实现的
12、js有哪些数据类型
*/