/*
一面感觉不错, 面试官非常专业, 态度也和蔼可亲;
终面的大哥比较盛气凌人, 疯狂PUA, 聊完后让我降薪, 就直接告辞了。
一面
1、react和vue在技术层面的区别
2、常用的hook都有哪些?
3、用hook都遇到过哪些坑?
4、了解useReducer吗
5、组件外侧let a 1 组件内侧点击事件更改a，渲染的a会发生改变吗？如果let a放在组件内部，有什么变化吗？和useState有什么区别？
6、了解过vue3吗?
7、Node是怎么部署的? pm2守护进程的原理?
8、Node开启子进程的方法有哪些?
9、进程间如何通信?
10、css 三列等宽布局如何实现? flex 1是代表什么意思？分别有哪些属性?
11、前端安全都了解哪些? xss csrfcsp是为了解决什么问题的?https是如何安全通信的?
12、前端性能优化做了哪些工作?
13、【代码题】 不定长二维数组的全排列// 输入 [['A', 'B', ...], [1, 2], ['a', 'b'], ...]
输出 ['A1a', 'A1b', ....]
14、【代码题】 两个字符串对比, 得出结论都做了什么操作, 比如插入或者删除pre = 'abcde123'now = '1abc123'
a前面插入了1, c后面删除了de

二面
1、【场景设计】 大数据列表如何设计平滑滚动和加载，下滑再上滑的操作，上下两个buffer区间如何变化和加载数据。
*/