/*
由于时间关系，没有细问简历中的项目内容，
面试官提示：可以准备性能优化相关【猫眼娱乐】一轮面试 
前端面试题分享形式：showmebug上面语音面试（未开视频），该平台支持在线协作，可以写代码

基础题
1、flex 布局：情景题 考察使用 flex=1 实现自适应宽度
2、移动端的适配问题 是否具有相关的经验
3、重排重绘
4、了解哪些浏览器缓存？考察： 协商缓存 强制缓存，他们 http请求头有何区别
5、tcp vs udp（可靠性/传输效率）; tcp更可靠的实现策略(流量控制/拥塞控制…)
6、http vs https 区别？7、webpack 热更新原理
8、tree shaking是否了解？有什么前置条件（需要适用于什么场景？）？基于什么规范（原理）怎么判定是否使用了-es6的规范，在编译前需要进行静态分析

react相关
1、jsx 和js区别？  jsx为什么只有允许有一个父节点
2、useState vs  类组件的setSate
3、useMemo 如何对值实现数据缓存

设计模式‍
1、熟悉什么设计模式？我回答 发布订阅，面试官要求 

手写伪代码算法题‍‍
1、最长回文子串
*/