/*
说下情况，末流985本科，1年工作经验，非知名小厂。个人技术也勉勉强强，毕竟工作后很多面试的东西不看了，天天在写业务，所谓“业务”，就是crud+表单表格那种，一开始实际水平一开始还没校招时候好，复习完后，才好起来了。
跳槽原因是之前待遇感觉有点低，被去年应届生倒挂了百分之三十+，倒挂百分之10左右我应该都是可以接受的。加上又是996，自己一个人扛三四个项目，参与三四个项目的部分模块。即做前端还写后端，兼职运维，外加客服（写了别人的工具和与别人对接的服务），非常非常累，就找机会撤了。

6月提离职，之后公司项目紧又天天加班的干了一个半月，7月中旬离职开始面试，离职前就面了腾讯，离职后面了剩下的，复习了大概一周左右时间。
为啥要离职再面是因为天天加班根本没时间复习，没离职之前面了一个被血虐，然后下狠心裸辞全心全意的准备，结果一周内面了四个全通过，估计现在再去面腾讯和头条也通过概率会很高了。
没面头条的原因是是在不想再去加班了，而且说实话还是有点虚，虽然刷了算法并且觉得现在知识几乎没盲点了。

现在资本寒冬，愿意给1年经验面试的公司真还挺少的，所以最后也就面了几家，把深圳愿意给1年经验的公司面完了，为什么只面深圳是因为我女朋友在深圳。

个人意愿：至少c轮以上初创，最好大厂

面了：微信 招银网络科技 小赢科技 携程 客路旅行
结果：除了微信全部通过，待遇总包都在22-30W之间，大概勉强赶上今年应届生价格吧。不过很多也比我之前涨了百分之50以上，而且这些没有一家是周末强制加班的。还是很满意的
最后去了招银网络科技，总包大概今年应届硕士的开发总包。



腾讯微信
我没想到1年经验被微信捞了，试一试的心态去了，而且我当时压根没复习，裸面的，挂了，没有一面让我能够满意吧。之后给我流到了别的部门可以继续面，不过我打算放弃了。
ps：滨海大厦可真是高大上，贼大，放着一排折叠床看懵逼了。


第一轮
先说下，大厂社招果然难，根本没有基础问题给你，面的令人窒息，一道简单问题也没有。后来才知道貌似就我没有，其他很多面腾讯的还是很多基础问题的，我咋这么倒霉。

1、手写promise

2、获取页面所有图片的src，得注意css部分的获取，有个dom方法，但我当时没想到说按行读文件

3、vue源码相关的一些问题，数据驱动层面的实现

4、element表格组件的实现

5、前端监控，问的非常细节

6、commonjs和es6 module的三个区别，webpack对模块怎么处理

7、webpcak HMR原理（我只知道用了websocket心跳包，更新代码）

8、打包优化，怎么变快

9、前端的性能优化

10、node.js的优化

11、egg.js多进程通信机制和架构。顺便聊操作系统进程通信那块。架构我很清楚master，agent，worker的，通信机制没答好，其实看过好几次但没记住。

第二轮
大量问业务，非常大量，总而言之就是某个功能为什么如此设计，为什么这样对接

1、http,tcp,dns,udp怼了一堆不过之前精通这块没翻车

2、设计模式，聊了10多种然后被面试官叫停了

3、随机洗牌算法，血崩没看过

4、webkit的一个阶段叫做XSSAuditor干啥的，发生在哪个阶段（我贼熟悉webkit，但恰恰这个忘了，作用猜出来了是过滤xss的，阶段猜错了）

第三轮
1、就一道问题，随机排座位算法，要有连坐功能。


小赢科技
办公环境和员工福利挺好的一家公司，盈利目前也很ok，p2p里的独角兽

第一轮
1、盒模型，居中，画三角形

2、栅格实现：flex，grid，

3、继承

4、HTML5新标签

5、前端存储与异同

6、websocket

7、闭包，内存管理（讲了V8的内存管理机制，新生代老生代的算法，这块应该加分了）

8、箭头函数this，set，promise等ES6语法

9、mysql查询两个表中的数据，写了两种方式说了性能有差异

10、js任务模型问题，输出什么，为什么我讲了微任务和宏任务，顺便比较了和node的libuv异同

11、手写代码深拷贝

12、整数数组中a+b=c的组合

还有一些我忘了

第二轮
1、前端安全csrf和xss

2、内存泄漏

3、页面监控，错误处理和性能信息，onerror用法

4、前端优化

5、HTTP1 1.1 2，我顺便说了已经有3了，面试官好像没听过http3一样我告诉他是QUIC协议

6、数据库优化

7、双向绑定原理，实现

8、闭包和模块模式

此外问了大量业务

第三轮
面试官是CTO，我直接说可以问我后端

1、数据库优化：说完索引，索引原理；说完分库，主从数据库数据一致性算法，

2、主从延迟问题；mysql架构，mysql引擎区别

3、接触过redis？说说redis雪崩问题

4、对node.js的理解

5、前端和后端安全

招银网络科技
腾讯大厦旁边，离我租的房子步行20分钟，美滋滋。
前台妹子职业ol风而且很漂亮。

一共一面，三个面试官

1、仍然先大量问了业务

2、css三角形，布局

3、vue的template是啥，模板引擎原理

4、vue和ng对比，和react对比

5、vue常见的指令，这个说完指令我说了实现，因为都看过源码

6、d3.js相关的一些东西

7、前端性能优化，那些可以实现自动化

8、npm查看已有包的命令（我猜npm ls，居然猜对了。。常写的都知道这个命令是真的其实很少用）

9、设计模式。仍然是聊high了被叫停

10、架构模式：mvc mvp mvvm

11、前端技术架构的演进，多页->单页->微服务（后来知道部门是基础设施架构部门，所以这块问的多一点）

12、CI相关的东西

13、docker相关的东西（在公司写了n多docker的脚本和file与yml了）

14、愿意写java吗，我说没问题，crud还是会的，然后被问了几句sql



面完给了我笔试题说本来是要先笔试后面试的，但是会议室紧张时间只有一个半小时，让我在茶水间补做了一下笔试题，感觉和校招笔试没啥区别，题很旧，有四五页，但20分钟做完了，应该几乎满分，后边HR开玩笑说这么快早知道让你在会议室做完了。我说除了几个api太老不常用我忘了外没不会的，几乎没思考就做完了当然快。


客路旅行（D轮）
在福田区，理我十多千米，好在我坐公交车可以直达，半小时多久到了，中午去的有点早，被人家公司前台当做是闲人来蹭沙发的，估计想赶我出去。然后一问我是面试的，尴尬了。
但不得不说这家公司的前台妹子真的太漂亮了，而且还不止一个！很fashon那种风格，让我不禁感叹果然出行公司就是不一样。
办公环境是小厂里边数一数二的，因为在二楼，甚至还有大阳台草坪。

第一轮
1面（虽然小厂但面试貌似挺牛，之前在去哪儿，美团，腾讯都呆过）

1、闭包和内存泄漏，变量提升，继承方式与优缺点

2、vue的diff

3、父子组件的created()和computed()的执行先后顺序，为什么

4、异步请求适合在哪个生命周期调用

5、前端优化，最好从你了解的webkit底层原理（简历写了）这块着手分析几种

6、webpack的打包原理和各个组成部分，自定义loader，HMR原理

7、splice和slice区别

8、koa看过原理？说说koa-compose咋实现中间件的（就这一个不会，我说了我确实看过和观察者模式有关。加上腾讯怼我的搞得我后来都不敢写熟悉node.js了）

9、es6实现几个简单应用，具体啥问题忘了，反正必须es6或者ts做

10、找出一个数组中最大的2个数之和（给了堆排序方案）

第二轮
1、块级元素和行级元素

2、HTTP常见头，状态码

3、Dom新增元素，dom删除元素，dom修改属性

4、前端监控

携程
唯一感觉hr太忙了，从投递到约面试过去很长时间，从面试到出结果也特别特别漫，服气的，最后我都接了别家的了。
不过听说是刚刚来深圳，开始组建团队，所以招人面人入职很多，而hr就一两个所以特别忙。

1、css三角形，居中，隐藏元素

2、前端安全

3、闭包，作用域，this指向，继承

4、手写代码，实现节流和防抖

5、set，map，weakset weakmap

6、vue生命周期，每个中间底层干了什么

7、双向绑定，proxy和defineProperty对比

8、游览器渲染全流程，你对这个token和node咋理解，讲了编译原理词法分析语法分析的东西

9、http 304和缓存机制

10、服务端渲染有没有了解过

11、promise并发，咋实现async

12、注册登录咋做的，确保安全的吗，聊了聊用到的加密机制和原理

13、一些业务问题

14、数组去重

15、正确的括号算法
*/
