/*
从7.24来长沙，7.29接到第一个面试一直到今天，真的中间有无数次面试之前紧张，到面试完的轻松，在到一直等通知。
天气热没有破防，路途远没有关系，但是今天为了省10块钱的打车费，坐公交，刷了两次，真的破防了……
咱乖咱听话，咱不找了，咱回家等通知或许只有把你按在地上摩擦才会触底反弹。。。

1、自我介绍（2个面试官） 
2、一个再看我简历，另外一个介绍公司业务三大项  
3、你登录权限怎么控制的，后端返回，那按钮，功能菜单怎么做的。 技术面试沉默低头看简历，那个人也沉默（我找话题）
4、小程序资源告警你怎么分包 
5、图片太大你怎么压缩，JPG和pig区别，底层逻辑为什么。分辨率。 
6、md5加密加密原理是什么
7、websocket有必要做嘛？为什么 
8、几种储存方式的区别coockie面试题比较偏后端，感觉面试官不太好意思拒绝我，就想和我闲聊。

7月30号上午电话沟通
1、自我介绍 
2、简单寒暄后现在已婚未婚了 
3、你做过什么项目 
我们公司主要做的业务   （老的网站系统需要前后端分离，和社保局合作系统需要维护），人员配比1前3后1产品 
4、薪资要求后面约我线下复试，但是感觉项目比较难做,会吃不下。 

08/01上午复试情况下礼拜三给回复，上班10个人左右。技术属于初创4-5个小team。
老板还问我家庭情况以及车房负债情况。做社保局xx网站的重构，五险一金，双休08/02下午2.30复试
1、主要问一些项目，以前公司人员架构开发流程前端规范，对后端了解，自己职业规划 
2、js倒序排序，js冒泡排序
3、promise 
4、箭头函数
5、car let和const
6、闭包
7、对页面的优化，浏览器怎样请求同步异步
8、node.js和对js的区别。
公司总部5个前端，有自己的产品 ,五险一金双休，朝9-5.307月31下午2点30面试希望在原有基础上做二次开发生成自己的库
1、对layui有没有自己的理解,二次封装的思路怎么做。 
2、jQuery怎么绑定方法
3、使用过html5画图嘛 
4、你后面的职业规划 
5、会用数据库嘛？ Mysql group分组是什么意思layui和jQuery确实都是很老的技术。不过是个很有礼貌的面试官，结尾的时候说了感谢这次的沟通。

08/01：线下笔试 jQuery+ layui+sql
08/02：复试 公司原有的底层架子需要改动，网站一些工作，0A系统要做，有没有大型项目经验，当甲方的经验?和ui怎么沟通，感觉看经验和主观能动性和沟通多一点。
五险一金+大小周

08月5日下年2点线上面试
1、Gis地图轨迹 
2、怎么改变this的指向(call apply bind) 
3、怎么添加空数组，里面添加20个。 
4、二次封装复选框组件点击下拉，怎么判断，点击其他地方让复选框不收回。 
5、判断异步同步，200秒的时候返回，思路 状态(promise的三种状态)
*/